
[A_DarkMagic_Skill H7Skill]
mName="Магия тьмы"
mTooltip="Позволяет изучать в гильдии магов заклинания магии тьмы, а также усиливать их и добавлять дополнительные эффекты."
mDescriptions[2]="Увеличивает эффективность заклинаний магии тьмы и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 1."
mDescriptions[3]="Увеличивает эффективность заклинаний магии тьмы и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 2."
mDescriptions[4]="Увеличивает эффективность заклинаний магии тьмы и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 3."
mDescriptions[0]="Увеличивает эффективность заклинаний магии тьмы и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний."
[A_DarkScholar_Ability H7HeroAbility]
mName="Искусный маг тьмы"
mTooltip="-%special.norm% к расходу маны на заклинания школы тьмы."
[A_DarkWisdom_Ability H7HeroAbility]
mName="Мудрость тьмы"
mTooltip="%stat1 к %stat1.icon магии для заклинаний магии тьмы. Любой навык категории «Мудрость» дополнительно дает герою %stat1 к %stat1.icon магии."
[A_SoulHarvest_Ability H7HeroAbility]
mName="Жатва душ"
mTooltip="Убив существо, герой получает %stat.norm ед. %stat.icon маны."
[A_MasterOfDarkness_I_Ability H7HeroAbility]
mName="Знание магии тьмы I"
mTooltip="%spell1.name и %spell2.name: теперь эти заклинания можно накладывать на отряды в выбранной области 4x4."
[A_MasterOfDarkness_II_Ability H7HeroAbility]
mName="Знание магии тьмы II"
mTooltip="%spell1.name: теперь заклинание дополнительно делает выбранный отряд невосприимчивым к заклинаниям союзников. Длительность (ходов): %spell1.spell.buff.buff.durini.\n%spell2.name: теперь выбранный вражеский отряд не сможет контратаковать в течение %spell2.spell.buff2.buff.buff1.buff.durini хода(ов)."

[A_CatatonicFear_Ability H7HeroAbility]
mName="Леденящий страх"
mTooltip="Подвергшийся нападению вражеский отряд, который находится под воздействем "Лика страха", теряет возможность контратаковать." 
[A_Curse_Ability H7HeroAbility]
mName="Проклятие"
mTooltip="Заклинание "Рассеивание" делает отряд невосприимчивым к заклинаниям союзников в течение 3 ходов."
[A_CursedGround_Ability H7HeroAbility]
mName="Проклятая земля"
mTooltip="Заклинания "Ослабление" и "Отчаяние" накладываются на всех вражеских существ в области 4x4."
[A_ImprovedTier1Spells_Ability H7HeroAbility]
mName="Знание магии тьмы I"
mTooltip="Заклинания "Ослабление" и "Отчаяние" накладываются на всех вражеских существ в области 4x4."
[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="Знание магии тьмы II"
mTooltip="Отряд, ставший целью "Рассеивания", становится невосприимчивым к заклинаниям союзнкиов на 3 хода. Подвергшиеся нападению вражеские отряды под воздействием "Лика страха" теряют возможность контратаковать."
[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="Знание магии тьмы III"
mTooltip="Заклинание "Агония" накладывается на всех вражеских существ в области 4x4. Любая копия, созданная заклинанием "Сумеречный образ", получает умение "Покров теней", которое длится 3 хода или до тех пор, пока отряд не уклонится от одной атаки."
[A_MassDespair_Ability H7HeroAbility]
mName="Отчаяние (общее)"
mTooltip="Заклинание "Отчаяние" накладывается на всех вражеских существ в области 4x4."
[A_ShadowOfDeath_Ability H7HeroAbility]
mName="Тень смерти"
mTooltip="Когда герой использует заклинание темной магии против вражеского отряда, число существ в отряде сокращается на %special%. Потерянные существа возвращаются после боя, если армия не потерпела поражение."
[A_ShadowVeil_Ability H7HeroAbility]
mName="Теневая вуаль"
mTooltip="Заклинание "Покров тьмы" накладывается на всех дружественных существ в области 2x2."

UCP 1.3

[A_ShadowOfDread_Ability H7HeroAbility]
mName="Тень отчаяния"
mTooltip="Каждый раз, когда герой использует заклинание магии тьмы против вражеского отряда, число существ в отряде сокращается на %special (с округлением в меньшую сторону). Потерянные существа возвращаются после боя, если армия не потерпела поражение.\nПри срабатывнии эта способность также предотвращает использование некромантии вражеским героем до конца боя."

7.5_v2 :

[A_MasterOfDarkness_III_Ability H7HeroAbility]
mName="Знание магии тьмы III"
mTooltip="%spell1.name: теперь заклинание можно накладывать на отряды в выбранной области 4x4.\n%spell2.name: в течение 3 ходов первая атака против существ, созданных при помощи этого заклинания, не достигнет цели.\n%spell3.name: действует на всех союзников в области 6x6."